const staticResourceUrl = (window.webConfig as any).staticResourceUrl || ''
const normalizePath = (path: string) => path.replace(/\\/g, '/').replace(/\/$/, '')
const markerBasePath = normalizePath((window.webConfig as any).mapMarkerUrl || '')

/**
 * @param {number}   shapes[].dRadius      - 水平半径（米）
 * @param {number}   shapes[].dHeightAdd   - 向上高度范围（米）
 * @param {number}   shapes[].dHeightReduce - 向下高度范围（米）
 */
export const chapter1TriggerPoints = [
    {
        // 化城寺石狮子触发点
        id: 'trigger1',
        name: '化城寺石狮子',
        position: [117.79732415373547, 30.480856782461718, 594.6723263383377],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    },
    {
        // 四大天王殿触发点
        id: 'trigger2',
        name: '四大天王殿',
        position: [117.79726894881047, 30.480931508860536, 597.7335737362472],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    },
    {
        // 大雄宝殿触发点
        id: 'trigger3',
        name: '大雄宝殿',
        position: [117.79709463078719, 30.48118616666771, 599.3836736975807],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    },
    // {
    //     // 天王殿触发点
    //     id: 'trigger4',
    //     name: '天王殿',
    //     position: [117.79709728038407, 30.481053697693202, 599.9654387357942],
    //     dRadius: 1,
    //     dHeightAdd: 0.5,
    //     dHeightReduce: 0.5
    // },
    {
        // 娘娘塔触发点
        id: 'trigger5',
        name: '娘娘塔',
        position: [117.79758062014552, 30.48037267333104, 592.9624901688162],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    },
    {
        // 月牙池触发点
        id: 'trigger6',
        name: '月牙池',
        position: [117.79743600323978, 30.48050667214479, 592.9404686900423],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    }
]

// Marker点位
export const chapter1MarkerPoints = [
    {
        name: '石狮',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79731499261287, 30.480842008843926, 596.943419177722]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '石狮1对,位于化城寺台阶两侧。一只戏球,一只携抱幼狮。相传为唐宋遗物，基本保存完好。'
    },
    {
        name: `”芬陀普教”匾额`,
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.797243219555, 30.480919012423165, 602.4022021049533]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '”芬陀普教”匾额为乾隆皇帝御书。清乾隆三十一年（1766），乾隆皇帝赐御书匾额”芬陀普教”。'
    },
    {
        name: `”九华圣境”匾额`,
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79730205133748, 30.48095150349125, 602.431311971136]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '”九华圣境”匾额为康熙皇帝御书。清康熙四十二年至四十四年（1703-1705），康熙皇帝三次降旨遣内侍来九华进香、赐银，并赐额”九华圣境”。'
    },
    {
        name: '化城寺',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79727237690952, 30.480932483214474, 603.1759959541155]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '',
        video: `${staticResourceUrl}/hcs.mp4`
    },
    {
        name: '大雄宝殿',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.7970657544606, 30.481224745374764, 605.8070370747258]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '化城寺前后四进。第一进为山门殿，第二进为天王殿，第三进为大雄宝殿，第四进为藏经楼，建筑占地面积2199.7平方米。后三进山墙融合地方建筑风格，采用皖南民居马头墙形式。'
    },
    {
        name: '藻井',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79699227193258, 30.48132501032212, 606.8270052049688]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '清光绪十五年(1889)建。其一称”大藻井”,在大雄宝殿正上方。直径440厘米,深170厘米,底部四面八方,环绕小斗拱一圈。八角部共雕饰8条龙,加藻井顶端1条飞龙和珠球,组成”九龙戏球”。藻井自底部向顶端分5层叠垒,第一层角部雕饰金花8朵;次下二层,雕饰祥云共16朵;余下二层,雕饰蝙蝠16只。'
    }
]

// 剧情介绍
export const chapter1IntroOne = [
    {
        id: 1,
        text: '新罗僧金地藏航海入唐后，寻遍名山，终在唐开元年间，驻锡九华。',
        audio: `/audio/chapter1/plotInfo/chapter1_intro_one_1.mp3`,
        duration: 7
    },
    {
        id: 2,
        text: '唐至德年间（约757），青阳诸葛节等人结伴登山，见一位僧人闭目端坐石屋之中——正是苦修的金地藏。',
        audio: `/audio/chapter1/plotInfo/chapter1_intro_one_2.mp3`,
        duration: 11
    },
    {
        id: 3,
        text: '众人深为感动，于是集众伐木，在原化城寺废基构筑台殿，以成琳宇，请僧居之。',
        audio: `/audio/chapter1/plotInfo/chapter1_intro_one_3.mp3`,
        duration: 9
    }
]

export const chapter1IntroTwo = [
    {
        id: 1,
        text: '唐建中二年（781年），池州太守张岩奏请朝廷，移“化城”旧额于此，寺名遂定为“化城寺”。寺名既取《法华经》“化城喻品”之意，也恰似“高山盆地、四面如城”的地形。其间，金地藏在此广施教化，声闻遐迩。',
        audio: `/audio/chapter1/plotInfo/chapter1_intro_two.mp3`,
        duration: 26
    }
]

export const chapter1IntroThree = [
    {
        id: 1,
        text: '金地藏于99岁跏趺而逝后，九华山被辟为世人敬仰的地藏道场，化城寺由此尊为开山祖寺，统摄全山寺庙，并形成了以化城寺为中心的向心式格局。',
        audio: `/audio/chapter1/plotInfo/chapter1_intro_three_1.mp3`,
        duration: 15
    },
    {
        id: 2,
        text: '岁月流转，至清光绪年间，化城寺终成四进院落，殿宇庄严，尽显皖南山川之美韵。',
        audio: `/audio/chapter1/plotInfo/chapter1_intro_three_2.mp3`,
        duration: 10
    },
    {
        id: 3,
        text: '而今，这座古刹成为国家重点守护的文脉，立于群山之间，向世人讲述着千年的故事。',
        audio: `/audio/chapter1/plotInfo/chapter1_intro_three_3.mp3`,
        duration: 8
    }
]

// 宝藏介绍
export const chapter1TreasureIntro = [
    {
        id: 1,
        text: '恭喜寻得一折足鼎!唐至德初年，山下长老诸葛节等人结伴登山，见僧闭目端坐石屋之中，身旁有一折足鼎，鼎中盛有少米掺白土煮剩之饭，群老不禁为其苦行肃然起敬。',
        audio: `/audio/chapter1/treasure/chapter1_treasure_1.mp3`,
        duration: 19
    }
]

export const dialogueOne = [
    {
        id: 1,
        text: '施主，你瞧见这座塔基和这口古井了吗？这可不是一口普通的井，它背后啊，藏着一位母亲的动人故事。',
        audio: `/audio/chapter1/chapter1_one_1.mp3`,
        duration: 10
    },
    {
        id: 2,
        text: '相传，金地藏在九华山修行后，其母因思念儿子，千里迢迢前来寻子。母子相见，悲喜交加，连哭三昼夜，几乎哭瞎双眼。金地藏为尽孝道，常取化城寺前一口井水，为母亲擦拭双眼。',
        audio: `/audio/chapter1/chapter1_one_2.mp3`,
        duration: 21
    },
    {
        id: 3,
        text: '经过一段时间的悉心照料，母亲的双眼终于复明。其母辞世后，后人为了纪念她，在井上修建了一座塔。称塔为“娘娘塔”，泉为“明眼泉”，以彰母慈子孝之美德。',
        audio: `/audio/chapter1/chapter1_one_3.mp3`,
        duration: 17
    }
]

export const dialogueTwo = [
    {
        id: 1,
        type: 'release', // 新增type字段，标识对话类型
        text: '对了，可曾留意娘娘塔前这一方月牙池？传说乃当年金地藏放生之处。今日有缘相遇，施主可愿静心驻足，寻得那有缘之鱼，放一程，生一念？',
        audio: `/audio/chapter1/chapter1_two_1.mp3`,
        duration: 16
    }
]

export const dialogueThree = [
    {
        id: 1,
        text: '善哉。施主一念，便成就了这池中千年来的又一段因缘。',
        audio: `/audio/chapter1/chapter1_three_1.mp3`,
        duration: 6
    },
    {
        id: 2,
        type: 'bells',
        text: '嘘，化城晚钟响了。化城蒲牢一杵，声满九十九峰。',
        audio: `/audio/chapter1/chapter1_three_2.mp3`,
        duration: 6
    }
]

export const dialogueFour = [
    {
        id: 1,
        type: 'end',
        text: '钟声响起，是九华山最热闹的时候。香火与万家炊烟同升，星光共灯火一色，诵经声与闲谈声萦于耳旁，交织成鲜活的人间景象。千百年来，皆是如此。',
        audio: `/audio/chapter1/chapter1_four_1.mp3`,
        duration: 17
    }
]

// 漫游路线
export const chapter1RoamPath = [
    [117.79734129793113, 30.480806731066753, 594.0304626435546],
    [117.79733483565542, 30.480847662757075, 594.2688345064331],
    [117.79732433584488, 30.480860325906647, 594.7612109061145],
    [117.79730394167788, 30.4808902828381, 597.2158542050319],
    [117.79728123575522, 30.480924711601162, 597.3102132520654],
    [117.79727485571627, 30.48093180070059, 597.7335739929201],
    [117.79725644447139, 30.480957417533112, 598.062579545999],
    [117.79724035511772, 30.480968909605696, 597.965138272552],
    [117.79721571439771, 30.480968824083, 597.9651396442872],
    [117.79719106698387, 30.48097655809127, 597.9651415169694],
    [117.79717718738702, 30.48098207973975, 597.965142969773],
    [117.79717026846076, 30.48098846309537, 598.1395547934192],
    [117.79715603110381, 30.481010051880165, 599.6924430685872],
    [117.79715504129645, 30.481019610779075, 599.6924457033194],
    [117.79716636210075, 30.481023169367067, 599.6924442683945],
    [117.79717951249579, 30.481034071297632, 599.6924445786223],
    [117.79719343443848, 30.48104030138402, 599.6924438692997],
    [117.79719192128458, 30.481047383484903, 599.7608015750936],
    [117.79718575415467, 30.481053558947462, 600.1122391409707],
    [117.7971791984649, 30.481062618204554, 599.9654191697052],
    [117.79716892370942, 30.481069056369087, 599.9654240053588],
    [117.79714161625971, 30.481055281522725, 599.9654254613919],
    [117.79712882569538, 30.48106621619809, 599.9654335313854],
    [117.79708937846065, 30.48112328323164, 599.9654712226132],
    [117.79708989239778, 30.481184535430597, 599.3836515744823],
    [117.79710698828875, 30.481193242671576, 599.383730777847],
    [117.79713521383871, 30.48118691622028, 599.3838694369528],
    [117.79715891795847, 30.481158718174438, 599.9654689354377],
    [117.7971831918741, 30.4811259381288, 599.9654457434737],
    [117.79720295352674, 30.481136128937816, 599.9654469720423],
    [117.79722926037917, 30.48112065466281, 599.965435053766],
    [117.79723957211546, 30.48110550111878, 599.9654263314028],
    [117.79721300699613, 30.48108728539823, 599.9654225833219],
    [117.7971858200233, 30.481073177766145, 599.9654216471527],
    [117.79718467683247, 30.481063479182286, 599.9654176791781],
    [117.79719140127538, 30.48104615369507, 599.8946853694207],
    [117.79720127219079, 30.48104552447802, 599.7351614733908],
    [117.79722211405091, 30.481056238199976, 599.6924443182586],
    //从这里下楼梯卡住
    [117.79723094463174, 30.48106129249584, 599.6924448370072],
    [117.79724019058396, 30.481064526548604, 599.6924447828544],
    [117.79724716762992, 30.481059328280494, 599.692442039362],
    [117.79725850740616, 30.481041732643426, 598.1528342974634],
    [117.79726969071989, 30.481010536982595, 597.9651392527652],
    [117.79725117064345, 30.48097382760936, 597.9651384355693],
    [117.79725770257672, 30.480958610438975, 598.0630466926337],
    [117.79726795579754, 30.480954485907834, 597.7335722417434],
    [117.79729591756255, 30.480966811764773, 597.7335727508148],
    [117.79731647769151, 30.480947958456483, 597.3760980511289],
    [117.79733963153866, 30.480908510843253, 597.1787717701364],
    [117.7973656386795, 30.480869399012036, 594.0724208930086],
    [117.79739479214989, 30.480831957734484, 593.720866602905],
    [117.79741293949542, 30.480801043190368, 593.4995238727205],
    [117.79742377765426, 30.48080465060167, 593.4967009449234],
    [117.79750807320214, 30.480837692472072, 593.4676148269426],
    [117.79752454826435, 30.48083635673442, 593.4605879638699],
    [117.79753441756486, 30.480814962931113, 593.4635884759542],
    [117.79756366084528, 30.480734913851492, 592.851186179862],
    [117.79759832004304, 30.4806330717084, 592.0854800948022],
    [117.79762999842052, 30.480552837369206, 592.0850464440072],
    [117.79762102195247, 30.480529788334493, 592.3103021513704],
    [117.79754987648926, 30.480515621385905, 592.8300451216066],
    [117.79752024279995, 30.48048854969166, 592.8301346459131],
    [117.79751716111113, 30.48046105071398, 592.8304744373202]
]
