const staticResourceUrl = (window.webConfig as any).staticResourceUrl || ''
const normalizePath = (path: string) => path.replace(/\\/g, '/').replace(/\/$/, '')
const markerBasePath = normalizePath((window.webConfig as any).mapMarkerUrl || '')

/**
 * @param {number}   shapes[].dRadius      - 水平半径（米）
 * @param {number}   shapes[].dHeightAdd   - 向上高度范围（米）
 * @param {number}   shapes[].dHeightReduce - 向下高度范围（米）
 */
export const chapter3TriggerPoints = [
    {
        // 山门口触发点
        id: 'trigger1',
        name: '山门口',
        position: [117.80381841796505, 30.483344052626123, 816.912323720697],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    }
    // {
    //     // 五百罗汉堂触发点
    //     id: 'trigger2',
    //     name: '五百罗汉堂',
    //     position: [117.80395434803435, 30.483091705848842, 827.1971014992802],
    //     dRadius: 1,
    //     dHeightAdd: 0.5,
    //     dHeightReduce: 0.5
    // }
]

// 宝藏介绍
export const chapter3TreasureIntro = [
    {
        id: 1,
        text: '“恭喜寻得一册《大方广佛华严经》！无瑕和尚在此不食烟火熟食，用功苦修。以野果为食，渴饮山泉，耗时20余年，抄写《大方广佛华严经》，计81卷，字迹工整，至今保存完好。”',
        audio: `/audio/chapter3/treasure/chapter3_treasure_1.mp3`,
        duration: 20
    }
]

export const dialogueOne = [
    {
        id: 1,
        text: '你已闻知地藏往昔，令无数僧众和信徒虔诚敬仰。而八百年后，又有一僧登临绝顶，让信仰的薪火再度炽燃，辉映山川。他，便是无暇禅师。',
        audio: `/audio/chapter3/chapter3_one_1.mp3`,
        duration: 16
    },
    {
        id: 2,
        text: '无暇禅师一生游历名山，曾遍访五台、峨眉等。于明万历年间，云游至九华山东崖岭结茅为庵，取名“摘星庵”。修行期间，他以舌血调和金粉抄写《大方广佛华严经》。明祟祯三年(1630)，无瑕禅师被敕封为"应身菩萨"。同年，无暇弟子慧广和尚改庵建寺，名“百岁宫”。',
        audio: `/audio/chapter3/chapter3_one_2.mp3`,
        duration: 31
    },
    {
        id: 3,
        type: 'target',
        text: '最近《大方广佛华严经》遗失在五百罗汉堂之中，请你帮我找到这册经书吧。',
        audio: `/audio/chapter3/chapter3_one_3.mp3`,
        duration: 7
    }
]

export const dialogueTwo = [
    {
        id: 1,
        text: '谢谢你帮我寻回这册《大方广佛华严经》！让宝物经典得以传颂，后世之人也能从这经文之中，探寻九华那些故事。',
        audio: `/audio/chapter3/chapter3_two_1.mp3`,
        duration: 11
    },
    {
        id: 2,
        text: '瞧，这五百罗汉堂，与百岁宫那边的走马通楼式主体建筑，共同构成了悬崖上的宏伟城堡。堂内五百尊贴金罗汉神态各异，栩栩如生，吸引四方信众前来虔诚祈福。',
        audio: `/audio/chapter3/chapter3_two_2.mp3`,
        duration: 17
    },
    {
        id: 3,
        type: 'bless',
        text: '施主，若有所愿，不妨在此放一盏孔明灯，让心愿随灯火，融汇九华万千灵韵之中。',
        audio: `/audio/chapter3/chapter3_two_3.mp3`,
        duration: 9
    }
]

export const dialogueThree = [
    {
        id: 1,
        type: 'end',
        text: '施主今日在罗汉堂中寻得经书，又燃灯寄愿，此行可谓圆满，功德无量。',
        audio: `/audio/chapter3/chapter3_three_1.mp3`,
        duration: 8
    }
]

// 漫游路线
export const chapter3RoamPath = [
    [117.8038054047736, 30.483325393810027, 816.9096857970296],
    [117.80381720891612, 30.48333172130548, 816.9129829962259],
    [117.8038183706964, 30.483343437457798, 816.9124824689771],
    [117.80381795261081, 30.483363010504835, 817.4964046404765],
    [117.80382099806187, 30.483381527930767, 817.4583921997398],
    [117.80381781285557, 30.48340339443058, 818.6319785685225],
    [117.80380872569978, 30.48341680178622, 818.6319594961244],
    [117.80380777655304, 30.48344687773275, 820.32559413005],
    [117.80380529900673, 30.483481778563007, 820.3799569283888],
    [117.80382115538669, 30.4834902774538, 820.3801484928308],
    [117.80384423096687, 30.483483269443298, 820.3803294898015],
    [117.8038474959674, 30.48347254747963, 820.3803063638421],
    [117.803864467319, 30.48344191381634, 823.0023782935958],
    [117.8038876881753, 30.48337434761444, 823.1468064114761],
    [117.80388245342517, 30.483325421433374, 825.3451651268194],
    [117.80387625398363, 30.483257840967887, 825.3540843500813],
    [117.8038748278705, 30.48319073877778, 825.3673566561364],
    [117.80387264764288, 30.483150027555276, 825.630353600702],
    [117.80387147909646, 30.48312836215148, 826.7171905770365],
    [117.80388496030336, 30.483122334116285, 826.7172911343331],
    [117.80390807826629, 30.483117464653684, 826.7174895089134],
    [117.80394470680426, 30.483098707893223, 826.8152037189277],
    [117.80395809871631, 30.483091359009666, 827.4733970759552],
    [117.80397671506122, 30.48308072432068, 827.4692068128446],
    [117.80397045519878, 30.483040854334234, 827.4689767260628],
    [117.80396496741255, 30.483003035374193, 827.4687650430084],
    [117.80396045054607, 30.48297594727724, 827.4686098809001],
    [117.80395845915737, 30.482960896307027, 827.4685294868257],
    [117.80397458369424, 30.482959711962526, 827.4686789583849],
    [117.8040243202166, 30.48295264903939, 827.4691297449122],
    [117.80407176873616, 30.482947544197433, 827.4695698379298],
    [117.8040822071084, 30.482946610275288, 827.4696676862372],
    [117.80408423786965, 30.48296074801051, 827.4697451471435],
    [117.8040903806686, 30.483000212532993, 827.4699673339267],
    [117.8040992210001, 30.483052639687553, 827.4702742748875],
    [117.8041120717769, 30.4831355015808, 827.4707594910042],
    [117.80412136017394, 30.483191874258512, 827.4711028426391],
    [117.80412257163297, 30.483202806979964, 827.4711639740627],
    [117.80411174518518, 30.48320624840107, 827.4710735144726],
    [117.80408435973048, 30.48320872247879, 827.4708170364117],
    [117.8040273133591, 30.483215712218573, 827.4702943491135],
    [117.80400025342746, 30.483219322009198, 827.4700493755834],
    [117.80399830341024, 30.483206541075155, 827.4699723174218],
    [117.80399199232083, 30.48316792657654, 827.4697371793653],
    [117.80398281804449, 30.48311257161865, 827.4694040317315],
    [117.80397877100941, 30.483106703429925, 827.4693395284529],
    [117.80396328642018, 30.48311049063204, 827.4735530005722],
    [117.80394086784707, 30.483113904279545, 826.7177863886072],
    [117.80393822347462, 30.48312236276982, 826.717798234981],
    [117.80394362331192, 30.483164673482577, 826.7180356774073],
    [117.8039541787922, 30.483248968483423, 826.7185177014769],
    [117.80396523152227, 30.48326122603948, 826.7186800062178],
    [117.80400303047404, 30.483259752902764, 826.7190367352472],
    [117.80401600811777, 30.483267214345105, 826.7191962332251]
]

// Marker点位
export const chapter3MarkerPoints = [
    {
        name: `"百岁宫"牌匾`,
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.80382185087582, 30.483341748844364, 821.4735540340321]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '门额高悬赵朴初先生所题匾额。',
        video: `${staticResourceUrl}/bsg.m4v`
    },
    {
        name: '皖南民居式四水归明堂形制',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.80379076915608, 30.483758736890525, 825.7849291336339]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '为皖南民居式四水归明堂形制，能有效排水和减缓风压，增强了建筑在恶劣天气下的稳定性和安全性。'
    },
    {
        name: '马头墙',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.80387125465474, 30.483596973204005, 825.4198798971894]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '九华山古建筑借鉴马头墙，兼具防火与美学功能。其装饰性融合了寺院的威严与民居的简洁，使徽派风格与寺院古建和谐统一。'
    },
    {
        name: `"钦赐百岁宫 护国万年寺"`,
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.80381589702314, 30.483764744117746, 825.0181659720142]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '为1917年中华民国大总统黎元洪所书。'
    },
    {
        name: '碑刻',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.80384280151144, 30.483745887568833, 821.8443566889636]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '门两侧墙壁镶嵌十余通碑刻，多为清代至民国时期，内容主要包括《藏经》、寺院修建志及功德捐资等。'
    },
    {
        name: '五百罗汉堂',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.80396954181542, 30.483084911886902, 836.4090743379617]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '五百罗汉堂位于百岁宫大殿南侧，1998年建成，两层宫殿式建筑，坐东朝西，飞檐翘角，蔚为壮观。五百罗汉堂一层正中供奉地藏比丘像，二层供奉五百罗汉群雕像，栩栩如生。'
    }
]
