const staticResourceUrl = (window.webConfig as any).staticResourceUrl || ''
const normalizePath = (path: string) => path.replace(/\\/g, '/').replace(/\/$/, '')
const markerBasePath = normalizePath((window.webConfig as any).mapMarkerUrl || '')

/**
 * @param {number}   shapes[].dRadius      - 水平半径（米）
 * @param {number}   shapes[].dHeightAdd   - 向上高度范围（米）
 * @param {number}   shapes[].dHeightReduce - 向下高度范围（米）
 */
export const chapter4TriggerPoints = [
    {
        // 祇园寺山门触发点
        id: 'trigger1',
        name: '祇园寺山门',
        position: [117.79929092376094, 30.482970701831768, 586.4595928557912],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    },
    {
        // 天王殿触发点
        id: 'trigger2',
        name: '天王殿',
        position: [117.7994222634086, 30.483146019548595, 586.87806101749],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    },
    {
        // 大雄宝殿触发点
        id: 'trigger3',
        name: '大雄宝殿',
        position: [117.79963498546927, 30.48335952094442, 591.5895738561067],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    },
    {
        // 万佛殿触发点
        id: 'trigger4',
        name: '万佛殿',
        position: [117.79985529373059, 30.483632302072873, 598.0403075612211],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    },
    {
        // 卧佛殿触发点
        id: 'trigger5',
        name: '卧佛殿',
        position: [117.79990790651847, 30.48323811333214, 597.6229289438736],
        dRadius: 1,
        dHeightAdd: 0.5,
        dHeightReduce: 0.5
    }
]

// 宝藏介绍
export const chapter4TreasureIntro = [
    {
        id: 1,
        text: '“恭喜寻得千僧锅！民国时期，厨房有7口大铜锅，最大一口直径173厘米、高56厘米，人称“千僧灶”，一次可煮米250千克。”',
        audio: `/audio/chapter4/treasure/chapter4_treasure_1.mp3`,
        duration: 14
    }
]

export const dialogueOne = [
    {
        id: 1,
        text: '跋涉至此，眼前便是九华山最大的十方丛林——祇园寺。它也是全山宫殿式与民居式组合规模最大的古寺。你看，其山门朝向化城寺方向，意为礼敬开山祖庭。',
        audio: `/audio/chapter4/chapter4_one_1.mp3`,
        duration: 17
    },
    {
        id: 2,
        text: '施主，可曾听闻‘祇园’二字的由来？',
        audio: `/audio/chapter4/chapter4_one_2.mp3`,
        duration: 3
    },
    {
        id: 3,
        text: '相传古印度时，有位孤独长者虔心向佛，欲以黄金铺地为价，买下波斯匿王家祇陀太子园林，准备请迎释迦如来佛祖。祗陀太子听说是要用于请佛之用，深受感动，便主动地献出园林。于是这座园林冠以二人名氏，全称“祇树给孤独园”，简称“祇园精舍”。',
        audio: `/audio/chapter4/chapter4_one_3.mp3`,
        duration: 27
    },
    {
        id: 4,
        type: 'resumeRoam',
        text: '祇园寺之名，便源于这段佳话。',
        audio: `/audio/chapter4/chapter4_one_4.mp3`,
        duration: 3
    }
]

export const dialogueTwo = [
    {
        id: 1,
        type: 'resumeRoam',
        text: '施主且看，殿内这位，竟是赤面如丹、三目如电的道教护法—王灵官！莫要疑惑。佛道二门，本无定界。这位王灵官，镇守于此，守护一方安宁。可见九华山的佛与道，早已在这片山水中悄然交融。',
        audio: `/audio/chapter4/chapter4_two_1.mp3`,
        duration: 21
    }
]

export const dialogueThree = [
    {
        id: 1,
        text: '你可知？民国时期，这里盛极一时。僧众云集，香火鼎盛。最盛时，一日便有千僧过堂，灶火不熄。',
        audio: `/audio/chapter4/chapter4_three_1.mp3`,
        duration: 12
    },
    {
        id: 2,
        type: 'target',
        text: '寺里厨房为此特铸了一口大锅。据说，那锅直径近三尺，与成年人的身高相仿。现在还在寺院某处。去找找吧，见了它便知当年有多盛。',
        audio: `/audio/chapter4/chapter4_three_2.mp3`,
        duration: 14
    }
]

export const dialogueFour = [
    {
        id: 1,
        text: '如今，穿行于祇园寺中，殿宇依山而筑，气势恢宏，金碧辉煌。它以建筑为骨，信仰为魂，融九华山水，纳多元文化。',
        audio: `/audio/chapter4/chapter4_four_1.mp3`,
        duration: 14
    },
    {
        id: 2,
        type: 'end',
        text: '香客游人，接踵而至，皆循着同一缕香火而来。这缕香，以地藏道场为根，在此生生不息。',
        audio: `/audio/chapter4/chapter4_four_2.mp3`,
        duration: 10
    }
]

// 漫游路线
export const chapter4RoamPath = [
    [117.79922133015506, 30.482776272495023, 586.2259750670777],
    [117.7992492651795, 30.48286641107038, 586.2680752035772],
    [117.79929001874244, 30.482970510338372, 586.2713440545621],
    [117.79930402477902, 30.482994682195258, 586.8377880276539],
    [117.79935457576158, 30.48306687339746, 586.7235179709788],
    [117.79942460617517, 30.483148615588558, 586.6864916783079],
    [117.79945159603393, 30.483172390181963, 587.6565074145096],
    [117.7994622829615, 30.48315817099477, 587.478471521191],
    [117.79950611447754, 30.483174525954315, 587.4786731239053],
    [117.79951493858775, 30.483187645046698, 587.6373313272985],
    [117.79957367545961, 30.48320142644006, 587.4834962499309],
    [117.7996203469705, 30.483214379683087, 590.3341668457538],
    [117.79965661019727, 30.483226306172448, 590.3414365604983],
    [117.79960064076495, 30.483339341206673, 590.3096972855136],
    [117.79963068259912, 30.48336109766054, 591.4012082649776],
    [117.79967484801304, 30.483372150385787, 591.3801298864319],
    [117.79970112617738, 30.483406137055095, 591.3803846723853],
    [117.79970522951326, 30.483439647070288, 591.3805643080689],
    [117.79977236551531, 30.483466426122675, 591.3809301939796],
    [117.79980773023335, 30.483431712576525, 591.3808472342425],
    [117.79984486160203, 30.48343755556515, 591.6685360637565],
    [117.79982441821123, 30.483480054847636, 593.5432727880057],
    [117.79980223853133, 30.48352718129093, 595.671673105549],
    [117.7997640904196, 30.483614428031316, 595.6621960817358],
    [117.79980447491538, 30.483621595353213, 597.6030208254564],
    [117.79983083686683, 30.483625714175815, 597.6026044915149],
    [117.7998590545958, 30.483634431280066, 597.8519838247132],
    [117.79988185468824, 30.483639781664383, 597.8520953933161],
    [117.79987669907072, 30.48369045185752, 597.8523508234181],
    [117.7999193862867, 30.483725202917388, 597.8526993352126],
    [117.79995408757306, 30.483706940037237, 597.8527288137078],
    [117.79996788458406, 30.48365451607026, 597.8524961114986],
    [117.79997865386152, 30.483590066660206, 597.8521938067953],
    [117.79995970371634, 30.48356731850409, 597.8520025010528],
    [117.79992281328694, 30.48359075748445, 597.8519872018525],
    [117.79988358555075, 30.483635734797783, 597.8520807447837],
    [117.79983528603495, 30.48362521573264, 597.6025294141706],
    [117.79984550360997, 30.483545261403826, 597.5853123355975],
    [117.79986750613003, 30.483450360514887, 597.5638769429929],
    [117.79989698089199, 30.48343014592915, 597.5562663898257],
    [117.79992560171648, 30.483363635559858, 597.518954603035],
    [117.79993475061771, 30.483329397452668, 597.5435611114875],
    [117.79989815675492, 30.48330750463585, 597.082536159686],
    [117.79988599217752, 30.48325407174348, 597.0839732650635],
    [117.79991149624915, 30.4832406030136, 597.5355061662668],
    [117.79995877744228, 30.48323744122855, 597.6346021031275],
    [117.80002568984646, 30.48323330991967, 597.6348395538738]
]

// 系统结束语
export const dialogueEnd = [
    {
        id: 1,
        text: '九华山群峰秀出，层峦叠翠，素有”东南第一山”之誉，为中国自然与文化双遗产。自唐代金地藏卓锡弘法，奠定道场，山中香火长燃千载，并与五台、峨眉、普陀一起位居中国佛教四大名山之列。',
        audio: `/audio/chapter4/conclusion/conclusion_1.mp3`,
        duration: 22
    },
    {
        id: 2,
        text: '这缕青烟里，燃的是大愿与大孝，照的是古往今来无数虔诚的脚步。山间的寺院古建、晨钟暮鼓、摩崖石刻等，无不诉说着坚守与奉献的修行，见证着儒释道与民间信仰的融合共生。今日你寻迹至此，亦为这千年道场增添一段数字缘起，让慈悲与愿力在这人间烟火里，绵延不息。',
        audio: `/audio/chapter4/conclusion/conclusion_2.mp3`,
        duration: 30
    }
]

// Marker点位
export const chapter4MarkerPoints = [
    {
        name: '祇园寺',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79930006927167, 30.482990383817906, 597.0988957559209]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '',
        video: `${staticResourceUrl}/qys.m4v`
    },
    {
        name: '青花白地映山门',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.7993106126131, 30.482986473765223, 590.5752060051676]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '门额墙壁上镶嵌白地青花的瓷匾，饰有八仙过海图案。'
    },
    {
        name: '山门',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.7993212055599, 30.482962060410525, 596.2216840331307]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '祇园寺山门为三层单檐歇山顶门楼，呈八字形，顶为三层重檐宝塔式建筑，半檐悬山顶，覆盖黄色琉璃筒瓦。'
    },
    {
        name: '雕梁画栋',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79927944961, 30.482996234287842, 594.1632003700014]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '山门雕梁画栋，色彩纷呈，主要有玄奘取经、水漫金山、渭水垂钓等神话故事。'
    },
    {
        name: '山门殿',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.7992683498341, 30.48298279718586, 591.8195999461499]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '山门殿布局独特，与天王殿、大雄宝殿不在同一轴线，形成45°角，体现了朝向开山祖寺化城寺的空间礼序。'
    },
    {
        name: '天王殿',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79943861087283, 30.483151977117025, 591.7299225499145]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '第二进天王殿为重檐歇山顶，供奉弥勒佛和四大天王塑像。'
    },
    // {
    //     name: '地藏殿',
    //     texturePath: `${markerBasePath}/marker/marker.png`,
    //     points: [[0, 0, 0]], // TODO: 待更新实际坐标
    //     pointSize: [38, 38],
    //     enableDepthTest: false,
    //     description:
    //         '地藏殿居大雄宝殿西侧，主供金地藏像，左为道明和尚，右为闵公。民间相传，闵公是九华山最大的地主，乐善好施，后与儿子道明先后拜金地藏为师。'
    // },
    // {
    //     name: '药师殿',
    //     texturePath: `${markerBasePath}/marker/marker.png`,
    //     points: [[0, 0, 0]], // TODO: 待更新实际坐标
    //     pointSize: [38, 38],
    //     enableDepthTest: false,
    //     description:
    //         '药师殿位于大雄宝殿对面，殿中主尊为药师殿，两侧分侍日光、月光菩萨，三者合称"东方三圣"。'
    // },
    // {
    //     name: '观音殿',
    //     texturePath: `${markerBasePath}/marker/marker.png`,
    //     points: [[0, 0, 0]], // TODO: 待更新实际坐标
    //     pointSize: [38, 38],
    //     enableDepthTest: false,
    //     description: '观音殿紧邻药师殿，主尊为观世音菩萨，两侧侍立善财童子与龙女。'
    // },
    {
        name: '大雄宝殿',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79964889455202, 30.483346659871653, 598.2472916280209]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '大雄宝殿为重檐歇山顶，覆以金黄色琉璃瓦，气宇非凡。脊高20.70米，平面进深18.70米，面宽25.20米。'
    },
    {
        name: '梁架结构奇巧',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79979633819897, 30.483388089554076, 599.2287963192402]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '殿内以巨型圆木为金柱，梁架结构奇巧，擎起整个殿顶，构成高敞空间。'
    },
    {
        name: '万佛殿',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79985091711464, 30.483645156299158, 603.6668354808787]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description: '万佛殿，纯木质结构，古朴典雅。殿内供奉五方五佛，为九华山独有。'
    },
    {
        name: '木雕',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79961527985073, 30.483261472340022, 592.9605402089973]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '九华山木雕主要分为三类：一是木架构中的梁枋、斗拱、雀替、斜撑、藻井等，是建筑承重体系的组成部分；二是槅扇、内檐门罩等；三是与佛教有关的器物上，如香案、佛龛等。在技法上，九华山木雕基本与徽州木雕相似，多采用浮雕、透雕、镂空雕等手法，刀法细腻流畅。在题材上，除了徽雕中常见的花、鸟、虫、鱼等图案外，更融入了佛教中的装饰纹样。不同于徽州木雕，九华山木雕施用色彩，凸显佛教圣地的庄严。'
    },
    {
        name: '卧佛殿',
        texturePath: `${markerBasePath}/marker/marker.png`,
        points: [[117.79990853849053, 30.483253156729905, 601.5832742486824]],
        pointSize: [38, 38],
        enableDepthTest: false,
        description:
            '万佛殿东侧为卧佛殿，正中供奉释迦牟尼卧佛。卧佛一手支头，一手搁身，刻工精湛，神态逼真。'
    }
]
